#include "modules/MDota.h"
#include "SMJS_Plugin.h"
#include "modules/MEntities.h"
#include "CDetour/detours.h"
#include "SMJS_Client.h"
#include "SMJS_Entity.h"
#include "SMJS_VKeyValues.h"
#include "sh_memory.h"
#include "game/shared/protobuf/usermessages.pb.h"
#include "game/shared/dota/protobuf/dota_usermessages.pb.h"
#include "MemoryUtils.h"
#include "MGame.h"

#define WAIT_FOR_PLAYERS_COUNT_SIG "\x83\x3D****\x00\x7E\x19\x8B\x0D****\x83\x79\x30\x00"
#define WAIT_FOR_PLAYERS_COUNT_SIG_LEN 19

#define USE_NETPROP_OFFSET(varName, clsName, propName) \
	static int varName = 0; \
	if(varName == 0){ \
		sm_sendprop_info_t prop; \
		if(!SMJS_Netprops::GetClassPropInfo(#clsName, #propName, &prop)){ \
			THROW("Couldn't find netprop " #propName " in " #clsName); \
		} \
		varName = prop.actual_offset; \
	}

#define USE_NETPROP_OFFSET_GENERAL(varName, clsName, propName) \
	static int varName = 0; \
	if(varName == 0){ \
		sm_sendprop_info_t prop; \
		if(!SMJS_Netprops::GetClassPropInfo(#clsName, #propName, &prop)){ \
			printf("Couldn't find netprop"); \
		} \
		varName = prop.actual_offset; \
	}

#define FIND_DOTA_PTR(name) \
	if(!dotaConf->GetMemSig(#name, (void**) &name) || name == NULL){ \
		smutils->LogError(myself, "Couldn't sigscan " #name); \
	} else { \
		name = *(void**)name; \
	}

#define FIND_DOTA_PTR_NEW(name, signature, offset) \
	if((*((void**)&name) = g_MemUtils.FindPattern(serverFac, signature, sizeof(signature) - 1)) == NULL){ \
		smutils->LogError(myself, "Couldn't sigscan " #name); \
	} else { \
		name = *(void**)((uintptr_t) name + offset); \
	}


#define FIND_DOTA_PTR2(name, type) \
	if(!dotaConf->GetMemSig(#name, (void**) &name) || name == NULL){ \
		smutils->LogError(myself, "Couldn't sigscan " #name); \
	} else { \
		name = *(type**)name; \
	}
	
#define FIND_DOTA_FUNC_NEW(name, signature) \
	if((*((void**)&name) = g_MemUtils.FindPattern(serverFac, signature, sizeof(signature) - 1)) == NULL){ \
		smutils->LogError(myself, "Couldn't sigscan " #name); \
	}

#define FIND_DOTA_FUNC(name) \
	if(!dotaConf->GetMemSig(#name, (void**) &name) || name == NULL){ \
		smutils->LogError(myself, "Couldn't sigscan " #name); \
	} \

WRAPPED_CLS_CPP(MDota, SMJS_Module);



enum LobbyType {
	LT_INVALID = -1,
	LT_PUBLIC_MM = 0,
	LT_PRACTISE,
	LT_TOURNAMENT,
	LT_TUTORIAL,
	LT_COOP_BOTS,
	LT_TEAM_MM,
	LT_SOLO_QUEUE
};

struct CUnitOrders
{
	int		m_iPlayerID;
	int		m_iUnknown;
	CUtlVector<int>	m_SelectedUnitEntIndexes;
	int		m_iOrderType;
	int		m_iTargetEntIndex;
	int		m_iAbilityEntIndex;
	Vector	m_TargetPos;
	bool	m_bQueueOrder;
};

struct LobbyData {
	void **vtable;
	uint8_t padding01[80];

	int gameMode; // 84
	int unknown01; // 88, values seen: 2, 3

	uint8_t padding02[8];

	LobbyType lobbyType; // 100: 0, 2, 5, 6
	bool bAllowCheats; // 104
	bool bFillWithBots; // 105
	uint8_t padding03[2];
	void **pSomethingAboutTeams; // 108
	int numTeams; // 112
	uint8_t padding04[44];
	uint32_t matchID; // 160
	uint8_t padding05[28];
	void **unknown; // 192
	int unknown02; // 196
	uint8_t padding06[8];
	int unknown03; // 208
	uint8_t padding07[4];
	bool bAllowSpectators; // 216
	uint8_t padding08[44];
	void **vtable2; // 264
};

enum FieldType {
	FT_Void = 0,
	FT_Float = 1,
	FT_Int = 5
};

struct AbilityField {
	uint32_t flags1; // EE FF EE FF (LE)
	union {
		int32_t asInt;
		float asFloat;
	} value;
		
	uint32_t flags2; // EE FF EE FF (LE)
	FieldType type;
};

struct AbilityData {
	char *field;
	char *strValue;
	char *unknown;

	struct {
		int32_t		something;
		FieldType	type;
	} root;

	AbilityField values[12];

	uint32_t	flags;
};


class CRecipientFilter : public IRecipientFilter
{
private:
        bool                            m_bReliable;
        bool                            m_bInitMessage;
        CUtlVector< int >               m_Recipients;
       
        // If using prediction rules, the filter itself suppresses local player
        bool                            m_bUsingPredictionRules;
        // If ignoring prediction cull, then external systems can determine
        //  whether this is a special case where culling should not occur
